app/controllers/articles_controller.rb

  def show
    id = params[:id]
    @article = Article.find(id)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @article = current_user.articles.build(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "content", "stars", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "rf'\"f"], ["content", "éf'"], ["stars", 3], ["created_at", "2018-06-04 16:28:40.837932"], ["updated_at", "2018-06-04 16:28:40.837932"], ["user_id", 2]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "stars" = ?, "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Deadpool 2"], ["stars", 4], ["content", "Film plutôt sympathique, cependant une légère preférance au premier"], ["updated_at", "2018-06-03 17:09:22.931531"], ["id", 5]]